<template>
    <div>
        <swiper class="swiper" :options="swiperOption">
            <swiper-slide class="text">
                <div>灵事件不要迷恋，哥走的是一种疯癫，玩的是一种心田，不希望他人与闲论而可以阻止与停留我个人的思想。

事与态的呈现，人与物的乱伦，不管你是咋样的想象与执念心扉的欲望，总之，心在，人在，未来的梦在，不要在意与迷恋过程的如何，你要相信自己的心，已经有了真正的答案，该想的就想，该做的就做，没有什么对与错，也没有什么遗忘与残破，划过伤痕只留遗迹，走过山盟海誓，多年的回忆，只剩下海枯石烂，做自己，想象心中与大众合为一致的心理，不偏不倚，才能，真能正比，仁道善意。

感悟多年，我一人走路，多年的心理，我一人单举，刚刚开始，盲目心智的灵魂，我好似灵魂摆渡，只剩幽灵心宿，坚持的悟道，我发觉，人生是多么奥妙，无穷的心理，深度心药，可以让你看到，这里，哪里，都可以有你，无你，都是自然，重要的是你，才是生命的主角，你可以，悦录那路人点点滴滴与染染鹤鹤，绝对不能与他们一起去混流成卓，因为，那样，你就丢了心灵，忘了己。

刚刚开始的野心与理想，都那么肯定，就不要拒绝与反悔过程的坎坷与迷度，因为那些都是必经之路，你有你的野心，就会遇到野性心理与心境，别管哪有多么长久与难堪，别在意那有多少雾言乱论，那些都是考验你的理智的心徒与提炼你心智的必答之题，至于你是咋样的答复与对待都是你自以为至 自心为度，绝对没有任何人与任何帮助你作弊，因为你本身就是答案。

关于爱情，我只能说是一种心情，爱要坦然，不爱要绝然，要么坦然自我心理与对方心智一起，不管对对错错，至少我们曾经走过，要么绝然欲望之度，什么诱惑与心理都毫无挂念，杜绝于海盟山河之外，天地人间之地，唯我独尊，任性孤独陌路，这就是爱情支柱与爱与不爱的心宿。

朋友千万种，谁能万众前，与我心扉陌路，度我心灵之素，你有你的底线与脾气，我有我的无线没脾气，不管脾气相对不相对，我们还是面对这不变的心醉，相信是一种认同与似己灵魂融入，而不是利益之徒，天涯芳草无一处，你我相信无虚度，认定了就要承受，不要为了一丝丝，一段段，不明的心理而转变本是很好的友情，因为哪样，再好的朋友都会成为幼碰，这就是为什么我们把朋友看的这么重要，想的这么的美好，现实确实那么的凄凉，朋友就是捧着捧着就有了，松了松了就散了，要么礼尚往来的交际不管贫富，只需，频繁善路，默默相助。

写了这些感悟与心术，我不想表达什么，很简单，我只是想，也许这些可以恰好可以对某些人与事有那么一点点或者一丝丝的指明点破，这就是我为什么爱世界的心理与心态。

最近，我有可能不会经常写感悟，我说过，玩完今年，我就有可能不会这样，玩心太重的去作践自己，作践自己我可以有，还有，那些看不惯我作践自己的人们，不管你是咋样想的，有什么用意，好与坏等等…… 我只想告诉!我作践自己，又不是作践你自己，何必这么嘴臭，你知道吗，有一种贱，比作践自己更贱的那种人就是这样的，因为，闲等之辈永远不懂身其之人，还高尚自己之心，高调自己的人生之语去变相般的炫耀自己。最为下贱，你要知道，真正心好的人不是语言巧合，而是不巧不合他们还在默默执着。</div>
            </swiper-slide>
        </swiper>
    </div>
</template>
<script>
import "vue-awesome-swiper/node_modules/swiper/dist/css/swiper.css"
import { swiper, swiperSlide } from "vue-awesome-swiper";

export default {
  data() {
    return {
      swiperOption:{
            // 竖屏滚动
            direction:'vertical',
            // 一屏之内swiperslide数量
            slidesPerView: 'auto',
            // 滑动不自动贴合
            freeMode: true,
            // 鼠标滚轮控制
            mousewheel:true
      }
    }
  },
  components: { swiper, swiperSlide }
}
</script>
<style scoped>
.swiper{
    height: 300px;
    overflow: hidden;
}
.text{
    font-size:18px;
    text-align: left;
    padding: 30px;
    height: auto;
    box-sizing: border-box;

}
</style>